In [ ]:
#default_exp DataLoading

# 10_load_data
> Loading the sample data

In [ ]:
# import packages
import pandas as pd
import janitor
import numpy as np
from sklearn.model_selection import train_test_split
# must install janitor package with the following shell command:
# 'conda install -c conda-forge pyjanitor'

In [ ]:
# read data files and clean names
individual_sample = pd.read_csv('sample_data/individual_sample.csv', sep = ',', skiprows=[1]).clean_names()
product = pd.read_csv('sample_data/product.csv', sep = '|', skiprows=[1]).clean_names()
sales_sample = pd.read_csv('sample_data/sales_data_sample.csv', sep = ',', skiprows=[1]).clean_names()
store = pd.read_csv('sample_data/store.csv', sep = '|', skiprows=[1]).clean_names()
vehicle_sample = pd.read_csv('sample_data/vehicle_sample.csv', sep = ',', skiprows=[1]).clean_names()

In [ ]:
individual_sample.shape

(99999, 5)

In [ ]:
individual_sample.head()

   unnamed_0  mzb_indiv_id email_optin_ind ah1_res_bus_indc supp1_bus_pander
0    2302009     263098627               Y                R                N
1   12836285     369527724               Y                R                N
2   16337753     552976498               Y                R                N
3   14239232     464651569               Y                R                N
4    3117446     267341408               Y                R                N

In [ ]:
product.shape

(56841, 13)

In [ ]:
product.head()

,article_id,prod_group_code,prod_group_desc,category_code,category_desc,segment_code,segment_desc,class_code,class_desc,discount_flag,cross_section,aspect_ratio,rim_size
0,20257,5.0,Tires,26.0,Passenger Tires,29.0,Performance Tires,37.0,S/T Performance Tires,N,225,60,16
1,53872,5.0,Tires,26.0,Passenger Tires,29.0,Performance Tires,37.0,S/T Performance Tires,N,215,60,14
2,20192,5.0,Tires,26.0,Passenger Tires,29.0,Performance Tires,37.0,S/T Performance Tires,N,195,65,15
3,45500,5.0,Tires,26.0,Passenger Tires,29.0,Performance Tires,37.0,S/T Performance Tires,N,175,70,13
4,20001,5.0,Tires,26.0,Passenger Tires,29.0,Performance Tires,37.0,S/T Performance Tires,N,205,70,14

In [ ]:
sales_sample.shape

(4000504, 9)

In [ ]:
sales_sample.head()

,unnamed_0,store_id,tran_id,date,article_id,indiv_id,vehicle_id,units,sales
0,1,337934,990994590,2018-07-23,7001647,318422234.0,944814728,0.0,-8.55
1,2,337934,990994590,2018-07-23,7001715,318422234.0,944814728,0.0,-50.45
2,3,337934,990994590,2018-07-23,7096547,318422234.0,944814728,0.0,10.00
3,4,337934,990994590,2018-07-23,7001647,318422234.0,944814728,0.0,0.00
4,5,337934,990994590,2018-07-23,7001715,318422234.0,944814728,0.0,0.00

In [ ]:
store.shape

(2813, 4)

In [ ]:
store.head()

   store_id state_code  zip_code  msa
0    244240         NE     68134  NaN
1    244233         MO     64151  NaN
2    227602         KY     40272  NaN
3    227603         KY     40219  NaN
4    232365         IN     46142  NaN

In [ ]:
vehicle_sample.shape

(99999, 6)

In [ ]:
vehicle_sample.head()

,unnamed_0,vehicle_id,make,model,sub_model,model_year
0,4616962,949893706,NISSAN,MURANO SV,SV,2014
1,12535557,953720646,CHEVROLET,MONTE CARLO LT,LT,2005
2,8953545,949554501,MERCEDES-BENZ,C300 4MATIC LUXURY,4Matic Luxury,2010
3,15025103,879337349,DODGE,GRAND CARAVAN SXT,SXT,2005
4,11657057,946122136,DODGE,DURANGO SLT,SLT 4x4,1999